============
[expression] Int
============

1

----

(source_file (integer_literal))

============
[expression] String literal
============

"привет мир"

----

(source_file (string_literal))


============
[expression] reference
============

this

----

(source_file (simple_ref))

============
[expression] another reference
============

hello

----

(source_file (simple_ref))


